Tekla.Structures.DialogInternal.dotdiaAttributeDataType_e
The primitive data types that TS Object Dialog tree supports

Tekla.Structures.DialogInternal.dotdiaAttributeDataType_e.Integer
The attribute is of type Integer

Tekla.Structures.DialogInternal.dotdiaAttributeDataType_e.Double
The attribute is of type Double

Tekla.Structures.DialogInternal.dotdiaAttributeDataType_e.String
The attribute is of type String